tap "dubeykartikay/lazyspotify", "https://github.com/dubeyKartikay/homebrew-lazyspotify"
# Any-to-PostScript filter
brew "a2ps"
# General-purpose data compression with high compression ratio
brew "xz"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Download with resuming and segmented downloading
brew "aria2"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# OpenAI's coding agent that runs in your terminal
brew "codex"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# Utility for IPMI control with kernel driver or LAN interface
brew "ipmitool"
# Simple terminal UI for git commands
brew "lazygit"
# Remote terminal application
brew "mosh"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Cross-platform ncurses Spotify client written in Rust
brew "ncspot"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@21"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@14"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# Rust toolchain installer
brew "rustup"
# Command-line tool to customize Spotify client
brew "spicetify-cli"
# Compressed read-only file system for Linux
brew "squashfs"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Upgrade all the things
brew "topgrade"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# ISO9660+RR manipulation tool
brew "xorriso"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# iOS App Store alternative
cask "altserver"
# Memory training application
cask "anki"
# Agent orchestration platform
cask "antigravity"
# Application uninstaller
cask "appcleaner"
# Universal chat app powered by Matrix
cask "beeper"
# OpenAI's official browser with ChatGPT built in
cask "chatgpt-atlas"
# Write, edit, and chat about your code with AI
cask "cursor"
cask "font-jetbrains-mono-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# AI-powered notepad for meetings
cask "granola"
# Chromium-based web browser
cask "helium-browser"
# Free and open-source media player
cask "iina"
# iOS Sideloading Companion
cask "iloader"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Visual diff and merge tool
cask "meld"
# VPN client
cask "mullvad-vpn"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# WebKit based web browser
cask "orion"
# Remote desktop
cask "parsec"
# Minecraft launcher
cask "prismlauncher"
# Spotify client
cask "psst"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# To-do list
cask "todoist-app"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Connect to Windows
cask "windows-app"
# Gecko based web browser
cask "zen"
vscode "anthropic.claude-code"
vscode "catppuccin.catppuccin-vsc"
vscode "github.vscode-github-actions"
vscode "icrawl.discord-vscode"
vscode "mechatroner.rainbow-csv"
vscode "minecraftcommands.syntax-mcfunction"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.js-debug-companion"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "spgoding.datapack-language-server"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-test"
vscode "vscodevim.vim"
vscode "yy0931.save-as-root"
vscode "zhuangtongfa.material-theme"
uv "-"
uv "viu-media"
