brew "xz"
brew "ansible"
brew "aria2"
brew "bat"
brew "chezmoi"
brew "ripgrep"
brew "codex"
brew "lima"
brew "colima"
brew "curl"
brew "docker"
brew "docker-compose"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "gnupg"
brew "gpgme"
brew "grep"
brew "ipmitool"
brew "lazygit"
brew "yt-dlp"
brew "mpv"
brew "neovim"
brew "nmap"
brew "nvm"
brew "openjdk@21"
brew "pinentry-mac"
brew "pnpm"
brew "postgresql@14", restart_service: :changed
brew "python-tk@3.13"
brew "rustup"
brew "squashfs"
brew "starship"
brew "tmux"
brew "uv"
brew "xorriso"
brew "zoxide"
cask "altserver"
cask "beeper"
cask "cursor"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "iina"
cask "intellij-idea-ce"
cask "libreoffice"
cask "meld"
cask "psst"
cask "raycast"
cask "rectangle"
cask "slack"
cask "tailscale-app"
cask "visual-studio-code"
cask "vlc"
vscode "anthropic.claude-code"
vscode "catppuccin.catppuccin-vsc"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "icrawl.discord-vscode"
vscode "mechatroner.rainbow-csv"
vscode "minecraftcommands.syntax-mcfunction"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.js-debug-companion"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "spgoding.datapack-language-server"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-test"
vscode "vscodevim.vim"
vscode "yy0931.save-as-root"
vscode "zhuangtongfa.material-theme"
